app/controllers/school_classes_controller.rb

    def create
        school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Geo"], ["room_number", 214], ["created_at", "2020-01-13 15:50:11.180389"], ["updated_at", "2020-01-13 15:50:11.180389"]]

    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Geography"], ["updated_at", "2020-01-13 16:10:30.426219"], ["id", 1]]