app/controllers/students_controller.rb

    def create
        student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Tom"], ["last_name", "Donovan"], ["created_at", "2020-01-13 15:22:31.235956"], ["updated_at", "2020-01-13 15:22:31.235956"]]

    def update
        student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]